### 📦 Plan for `sbx/eu-west-1/ecr`
```hcl
07:10:41.226 STDOUT terraform: Terraform used the selected providers to generate the following execution
07:10:41.227 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
07:10:41.227 STDOUT terraform:   + create
07:10:41.227 STDOUT terraform: Terraform will perform the following actions:
07:10:41.227 STDOUT terraform:   # aws_ecr_lifecycle_policy.default_policy["microservice-a"] will be created
07:10:41.227 STDOUT terraform:   + resource "aws_ecr_lifecycle_policy" "default_policy" {
07:10:41.227 STDOUT terraform:       + id          = (known after apply)
07:10:41.227 STDOUT terraform:       + policy      = jsonencode(
07:10:41.227 STDOUT terraform:             {
07:10:41.227 STDOUT terraform:               + rules = [
07:10:41.227 STDOUT terraform:                   + {
07:10:41.227 STDOUT terraform:                       + action       = {
07:10:41.227 STDOUT terraform:                           + type = "expire"
07:10:41.227 STDOUT terraform:                         }
07:10:41.227 STDOUT terraform:                       + description  = "Remove untagged images after 3 days."
07:10:41.227 STDOUT terraform:                       + rulePriority = 1
07:10:41.227 STDOUT terraform:                       + selection    = {
07:10:41.227 STDOUT terraform:                           + countNumber = 3
07:10:41.227 STDOUT terraform:                           + countType   = "sinceImagePushed"
07:10:41.227 STDOUT terraform:                           + countUnit   = "days"
07:10:41.227 STDOUT terraform:                           + tagStatus   = "untagged"
07:10:41.227 STDOUT terraform:                         }
07:10:41.227 STDOUT terraform:                     },
07:10:41.227 STDOUT terraform:                   + {
07:10:41.227 STDOUT terraform:                       + action       = {
07:10:41.228 STDOUT terraform:                           + type = "expire"
07:10:41.228 STDOUT terraform:                         }
07:10:41.228 STDOUT terraform:                       + description  = "Remove images created by pull-requests older than 7 days."
07:10:41.228 STDOUT terraform:                       + rulePriority = 2
07:10:41.228 STDOUT terraform:                       + selection    = {
07:10:41.228 STDOUT terraform:                           + countNumber    = 7
07:10:41.228 STDOUT terraform:                           + countType      = "imageCountMoreThan"
07:10:41.228 STDOUT terraform:                           + tagPatternList = [
07:10:41.228 STDOUT terraform:                               + "*pull_request*",
07:10:41.228 STDOUT terraform:                             ]
07:10:41.228 STDOUT terraform:                           + tagStatus      = "tagged"
07:10:41.228 STDOUT terraform:                         }
07:10:41.228 STDOUT terraform:                     },
07:10:41.228 STDOUT terraform:                   + {
07:10:41.228 STDOUT terraform:                       + action       = {
07:10:41.228 STDOUT terraform:                           + type = "expire"
07:10:41.228 STDOUT terraform:                         }
07:10:41.228 STDOUT terraform:                       + description  = "Expire images older than 50 days."
07:10:41.228 STDOUT terraform:                       + rulePriority = 3
07:10:41.228 STDOUT terraform:                       + selection    = {
07:10:41.228 STDOUT terraform:                           + countNumber = 50
07:10:41.228 STDOUT terraform:                           + countType   = "imageCountMoreThan"
07:10:41.228 STDOUT terraform:                           + tagStatus   = "any"
07:10:41.228 STDOUT terraform:                         }
07:10:41.228 STDOUT terraform:                     },
07:10:41.228 STDOUT terraform:                 ]
07:10:41.228 STDOUT terraform:             }
07:10:41.228 STDOUT terraform:         )
07:10:41.228 STDOUT terraform:       + registry_id = (known after apply)
07:10:41.228 STDOUT terraform:       + repository  = "microservice-a"
07:10:41.228 STDOUT terraform:     }
07:10:41.228 STDOUT terraform:   # aws_ecr_lifecycle_policy.default_policy["microservice-b"] will be created
07:10:41.228 STDOUT terraform:   + resource "aws_ecr_lifecycle_policy" "default_policy" {
07:10:41.228 STDOUT terraform:       + id          = (known after apply)
07:10:41.228 STDOUT terraform:       + policy      = jsonencode(
07:10:41.228 STDOUT terraform:             {
07:10:41.228 STDOUT terraform:               + rules = [
07:10:41.228 STDOUT terraform:                   + {
07:10:41.228 STDOUT terraform:                       + action       = {
07:10:41.228 STDOUT terraform:                           + type = "expire"
07:10:41.228 STDOUT terraform:                         }
07:10:41.228 STDOUT terraform:                       + description  = "Remove untagged images after 3 days."
07:10:41.228 STDOUT terraform:                       + rulePriority = 1
07:10:41.228 STDOUT terraform:                       + selection    = {
07:10:41.228 STDOUT terraform:                           + countNumber = 3
07:10:41.228 STDOUT terraform:                           + countType   = "sinceImagePushed"
07:10:41.228 STDOUT terraform:                           + countUnit   = "days"
07:10:41.229 STDOUT terraform:                           + tagStatus   = "untagged"
07:10:41.229 STDOUT terraform:                         }
07:10:41.229 STDOUT terraform:                     },
07:10:41.229 STDOUT terraform:                   + {
07:10:41.229 STDOUT terraform:                       + action       = {
07:10:41.229 STDOUT terraform:                           + type = "expire"
07:10:41.229 STDOUT terraform:                         }
07:10:41.229 STDOUT terraform:                       + description  = "Remove images created by pull-requests older than 7 days."
07:10:41.229 STDOUT terraform:                       + rulePriority = 2
07:10:41.229 STDOUT terraform:                       + selection    = {
07:10:41.229 STDOUT terraform:                           + countNumber    = 7
07:10:41.229 STDOUT terraform:                           + countType      = "imageCountMoreThan"
07:10:41.229 STDOUT terraform:                           + tagPatternList = [
07:10:41.229 STDOUT terraform:                               + "*pull_request*",
07:10:41.229 STDOUT terraform:                             ]
07:10:41.229 STDOUT terraform:                           + tagStatus      = "tagged"
07:10:41.229 STDOUT terraform:                         }
07:10:41.229 STDOUT terraform:                     },
07:10:41.229 STDOUT terraform:                   + {
07:10:41.229 STDOUT terraform:                       + action       = {
07:10:41.229 STDOUT terraform:                           + type = "expire"
07:10:41.229 STDOUT terraform:                         }
07:10:41.229 STDOUT terraform:                       + description  = "Expire images older than 50 days."
07:10:41.229 STDOUT terraform:                       + rulePriority = 3
07:10:41.229 STDOUT terraform:                       + selection    = {
07:10:41.229 STDOUT terraform:                           + countNumber = 50
07:10:41.229 STDOUT terraform:                           + countType   = "imageCountMoreThan"
07:10:41.229 STDOUT terraform:                           + tagStatus   = "any"
07:10:41.229 STDOUT terraform:                         }
07:10:41.229 STDOUT terraform:                     },
07:10:41.229 STDOUT terraform:                 ]
07:10:41.229 STDOUT terraform:             }
07:10:41.229 STDOUT terraform:         )
07:10:41.229 STDOUT terraform:       + registry_id = (known after apply)
07:10:41.229 STDOUT terraform:       + repository  = "microservice-b"
07:10:41.229 STDOUT terraform:     }
07:10:41.229 STDOUT terraform:   # aws_ecr_repository.ecr_repository["microservice-a"] will be created
07:10:41.229 STDOUT terraform:   + resource "aws_ecr_repository" "ecr_repository" {
07:10:41.229 STDOUT terraform:       + arn                  = (known after apply)
07:10:41.229 STDOUT terraform:       + id                   = (known after apply)
07:10:41.229 STDOUT terraform:       + image_tag_mutability = "MUTABLE"
07:10:41.229 STDOUT terraform:       + name                 = "microservice-a"
07:10:41.229 STDOUT terraform:       + registry_id          = (known after apply)
07:10:41.229 STDOUT terraform:       + repository_url       = (known after apply)
07:10:41.229 STDOUT terraform:       + tags                 = {
07:10:41.229 STDOUT terraform:           + "Environment" = "dev"
07:10:41.229 STDOUT terraform:           + "Terragrunt"  = "true"
07:10:41.229 STDOUT terraform:         }
07:10:41.229 STDOUT terraform:       + tags_all             = {
07:10:41.229 STDOUT terraform:           + "Data-classification" = "internal"
07:10:41.229 STDOUT terraform:           + "Environment"         = "dev"
07:10:41.230 STDOUT terraform:           + "Managed-by"          = "terragrunt"
07:10:41.230 STDOUT terraform:           + "Organization"        = "genopsx"
07:10:41.230 STDOUT terraform:           + "Terragrunt"          = "true"
07:10:41.230 STDOUT terraform:         }
07:10:41.230 STDOUT terraform:       + image_scanning_configuration {
07:10:41.230 STDOUT terraform:           + scan_on_push = true
07:10:41.230 STDOUT terraform:         }
07:10:41.230 STDOUT terraform:     }
07:10:41.230 STDOUT terraform:   # aws_ecr_repository.ecr_repository["microservice-b"] will be created
07:10:41.230 STDOUT terraform:   + resource "aws_ecr_repository" "ecr_repository" {
07:10:41.230 STDOUT terraform:       + arn                  = (known after apply)
07:10:41.230 STDOUT terraform:       + id                   = (known after apply)
07:10:41.230 STDOUT terraform:       + image_tag_mutability = "MUTABLE"
07:10:41.230 STDOUT terraform:       + name                 = "microservice-b"
07:10:41.230 STDOUT terraform:       + registry_id          = (known after apply)
07:10:41.230 STDOUT terraform:       + repository_url       = (known after apply)
07:10:41.230 STDOUT terraform:       + tags                 = {
07:10:41.230 STDOUT terraform:           + "Environment" = "dev"
07:10:41.230 STDOUT terraform:           + "Terragrunt"  = "true"
07:10:41.230 STDOUT terraform:         }
07:10:41.230 STDOUT terraform:       + tags_all             = {
07:10:41.230 STDOUT terraform:           + "Data-classification" = "internal"
07:10:41.230 STDOUT terraform:           + "Environment"         = "dev"
07:10:41.230 STDOUT terraform:           + "Managed-by"          = "terragrunt"
07:10:41.230 STDOUT terraform:           + "Organization"        = "genopsx"
07:10:41.230 STDOUT terraform:           + "Terragrunt"          = "true"
07:10:41.230 STDOUT terraform:         }
07:10:41.230 STDOUT terraform:       + image_scanning_configuration {
07:10:41.230 STDOUT terraform:           + scan_on_push = true
07:10:41.230 STDOUT terraform:         }
07:10:41.231 STDOUT terraform:     }
07:10:41.231 STDOUT terraform: Plan: 4 to add, 0 to change, 0 to destroy.
07:10:41.231 STDOUT terraform: Changes to Outputs:
07:10:41.231 STDOUT terraform:   + repositories_arns = {
07:10:41.231 STDOUT terraform:       + microservice-a = (known after apply)
07:10:41.231 STDOUT terraform:       + microservice-b = (known after apply)
07:10:41.231 STDOUT terraform:     }
07:10:41.231 STDOUT terraform:   + repositories_urls = {
07:10:41.231 STDOUT terraform:       + microservice-a = (known after apply)
07:10:41.231 STDOUT terraform:       + microservice-b = (known after apply)
07:10:41.231 STDOUT terraform:     }
```
